-- 如果一个国家满足下述两个条件之一，则认为该国是 大国 ：
-- 面积至少为 300 万平方公里（即，3000000 km2），或者
-- 人口至少为 2500 万（即 25000000）

-- 输入：
-- World 表：
-- +-------------+-----------+---------+------------+--------------+
-- | name        | continent | area    | population | gdp          |
-- +-------------+-----------+---------+------------+--------------+
-- | Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |
-- | Albania     | Europe    | 28748   | 2831741    | 12960000000  |
-- | Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |
-- | Andorra     | Europe    | 468     | 78115      | 3712000000   |
-- | Angola      | Africa    | 1246700 | 20609294   | 100990000000 |
-- +-------------+-----------+---------+------------+--------------+
-- 输出：
-- +-------------+------------+---------+
-- | name        | population | area    |
-- +-------------+------------+---------+
-- | Afghanistan | 25500100   | 652230  |
-- | Algeria     | 37100000   | 2381741 |
-- +-------------+------------+---------+

-- https://leetcode.cn/problems/big-countries

select name, population, area 
from World
where (area >= 3000000) or (population >= 25000000) 